int main()
{
    setlocale(NULL, "ukr");
    Вивід << "n = ";
    Змінна n;
    Ввести >> n;
    int* ar = new int[n]; // Виділення пам'яті для массива із n елементів.
    cout << "Заповнiть масив:\n";

    Для (int i = 0; i < n; i++) //цикл сторення послідновності
    {
        Вивід << i + 1 << ") ";
        Ввести >> ar[i];
    }

    Змінна math;
    Змінна i, j;

    Для (j = 0, i = n - 1; j < i; --i, ++j)
    {
        math = ar[i]; // масив
        ar[i] = ar[j];
        ar[j] = math;
    }

    Для (int m = 0; m < n; m++)
        Вивід << "\n" << ar[m] << " ";

    Вивід << enter;
    Видалити[] ar;

    Вернути 0;
}
